//自定义函数
//定义一个函数比较两个数的大小
#include<stdio.h>
//int get_max(int x, int y)//此处get_max为自定义函数
//{
//	if (x > y)
//		return x;
//	else
//		return y;
//}
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int max = get_max(a, b);
//	printf("%d\n", max);
//	return 0;
//}


//扩展：实际参数：真实传递给函数的参数，在进行函数调用时，他们都必须要有确定的值，以便把值传递给形式参数

//形式参数：形式参数是指函数名括号中的变量，因为形式参数只有在函数被调用的过程中才实例化，所以叫形式参数，形式参数
//当函数调用完之后就销毁了，因此形式参数只在函数中有效




//定义函数交换两个数值
//错误方法-----传值调用：形参与实参分别占有不同内存块，对形参的修改不会影响实参
//错误原因是调用的函数x与y的地址不等于a与b
//void swap1(int x, int y)               此处函数名后的括号内的参数叫形式参数
//{
//	int z = 0;
//	z = x;
//	x = y;
//	y = z;
//}
//int main()
//{
//	int a = 10;
//	int b = 20;
//	printf("a=%d b=%d\n", a, b);
//	swap1(a, b);                          此处a与b为形式参数
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}
//正解-----传址调用
//void swap2(int* pa, int* pb)             此处括号内的参数叫形式参数，但将地址传来所以电脑可以通过形参找回实参从而进行修改
//{
//	int z = 0;
//	z = * pa;
//	* pa = * pb;
//	* pb = z;
//}
//int main()
//{
//	int a = 10;
//	int b = 20;
//	printf("a=%d b=%d\n", a, b);
//	swap2(&a, &b);                  此处&a与&b为实际参数
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}

//结论：当实参传递给形参的时候，形参其实是实参的一份临时拷贝，对形参的修改是不会改变实参的
